#### BuiltInFailures.SplineFailures Members

---

|  |
| --- |
| BuiltInFailures SplineFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures SplineFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotCreateSpline | Can't make Spline. |
| Public property Static member | ClosedSpline | Closed or self-intersecting splines are not allowed. |

# See Also

BuiltInFailures SplineFailures Class

Autodesk.Revit.DB Namespace